public/phases/VVM.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-07 Wed 17:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>VVM Roadmap</title>
<meta name="author" content="Dowland Aiello" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../theme/rethink.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">VVM Roadmap</h1>

<div id="outline-container-org561e007" class="outline-2">
<h2 id="org561e007"><span class="todo TODO">TODO</span> Vision Virtual Machine <code>[2/4]</code></h2>
<div class="outline-text-2" id="text-org561e007">
<p>
The Vision Virtual Machine is a module for the <b>Beacon DAO</b> that allows for general computation, and execution of arbitrary code with access to a limited, event-driven API for system-call-like functionality.
</p>

<ul class="org-ul">
<li><i>ETA: Early-December</i></li>
<li>Assignee: <b>Dowland Aiello</b>, <b>Lawrence Qupty</b></li>
</ul>
</div>

<div id="outline-container-org53dab53" class="outline-3">
<h3 id="org53dab53"><span class="done DONE">DONE</span> Main Event Loop / Scheduler</h3>
<div class="outline-text-3" id="text-org53dab53">
<p>
A process scheduler that uses an event loop to facilitate system calls, and communication between processes. Identifies processes on a per-DAO basis, where each instance of the process is unique, and identified by a hexadecimal address. Rapidly toggles between processes to emulate time-sharing.
</p>
</div>
</div>

<div id="outline-container-orgeab8e5b" class="outline-3">
<h3 id="orgeab8e5b"><span class="todo TODO">TODO</span> ABI Capabilities System</h3>
<div class="outline-text-3" id="text-orgeab8e5b">
<p>
An import-based system that signals capabilities of a loaded module, and which events it is capable of emitting. Will be implemented via WASM module imports, likely. Bindings for languages required.S
</p>
</div>
</div>

<div id="outline-container-org62387aa" class="outline-3">
<h3 id="org62387aa"><span class="todo TODO">TODO</span> Root Discovery Module</h3>
<div class="outline-text-3" id="text-org62387aa">
<p>
A base module included with the Beacon DAO that queues modules for instantiation by the VVM.
</p>
</div>
</div>

<div id="outline-container-org37d00d1" class="outline-3">
<h3 id="org37d00d1"><span class="done DONE">DONE</span> Granular Consent Model</h3>
<div class="outline-text-3" id="text-org37d00d1">
<p>
A kernel module that implements a system for acquiring user consent, based on the messages that an application can emit, which represent the API's that it has access to (e.g., <i>"x application is requesting access to your wallet"</i>).
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 06/22/2022</p>
<p class="author">Author: Dowland Aiello</p>
<p class="date">Created: 2022-12-07 Wed 17:13</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
